#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/YtseJam/canary-rolling/runs/run-MGaohj63aS8EaA7w

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_lb_listener.HTTP: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02fdd976dc15358bb]
aws_lb_target_group.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-092bffe8da51b2f05]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b09d3b8a3abe0d17]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-012509703aef2baf1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f0633d91370d731b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-008d548389d3f68d7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b59983eab883e59c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d92023b7b0a9b60a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07b2d09c8ee7f7817]
module.web_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03b4abbc2aa4dc2b1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2ca6eea23a71835]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d4f35d428d06277e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d68d602a8bc714b5]
module.lb_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-046d8788965975beb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b59983eab883e59c1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04dc82de06f5e347b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05087b9bfb63603f3]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029ce3333824c2765]
module.web_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-4015958443]
module.web_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-827565967]
module.web_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2238773635]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-092175a41bdc6623a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06331fa3459aa2ed9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0440aab6a6a78f339]
module.lb_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3627565441]
module.lb_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4117155784]
module.lb_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-454230301]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lb_listener.HTTP has been deleted
  - resource "aws_lb_listener" "HTTP" {
      - id                = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null

      - default_action {
          - order            = 0 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
          - type             = "forward" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c"
          + type             = "forward"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @adadeeeh, Action: `pull_request`*